Revit 2024 API
FabricationServiceButton.IsAHanger Property
 Checks if the fabrication service button is hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsAHanger { get; }
Visual Basic
Public ReadOnly Property IsAHanger As Boolean
	Get
Visual C++
public:
property bool IsAHanger {
	bool get ();
}
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace